{
    "nome": "Sérgio Ricardo",
    "email": "sergioricardo63@gmail.com",
    "linkedin": "https://www.linkedin.com/in/sergio-ricardo-l/",
    "job": "Desenvolvedor de Software",
    "location": "Ipatinga - MG - Brasil",
    "language": [
        "Português (Fluente)",
        "Inglês (Intermediário)"
    ],
    "formacao": [
        {
            "titulo": "Ensino médio",
            "instituicao": "Escola Selim José de Sales",
            "ano": "2012 - 2014"
        },
        {
            "titulo": "Curso técnio em Informática",
            "instituicao": "CEST",
            "ano": "2013 - 2015"
        },
        {
            "titulo": "Bacharel em Sistemas de Informação",
            "instituicao": "UNICA",
            "ano": "2015 - 2019"
        },
        {
            "titulo": "Pós graduação em Big Data e Data Science",
            "instituicao": "PUC Minas",
            "ano": "2020 - 2021"
        }
    ],
    "experiencia": [
        {
            "titulo": "Auxiliar de Suporte Técnico",
            "instituicao": "Automatec Automação Comercial",
            "ano": "2015 - 2019",
            "descricao": "Trabalhei como Auxiliar de Suporte a mais de 5 sistemas ERP's, que atuam em diversos seguimentos como Padarias, Supermercados, Postos de Combustíveis e dentre outros. Trabalhando em conjunto com diversas contabilidade, adquiri conhecimentos fiscais e tributários o que proporcionou o entendimento dos processos fiscais e contábeis dentro da organização. Ao trabalhar com sistemas em diferentes segmentos, obteve uma visão mais ampla dos principais processos presentes hoje nos sistemas ERP's. Empresas na qual trabalhei prestando suporte aos seus softwares : Digisat Tecnologia, Getway Automação Comercial, Xpert Tecnologia em Automação, CompuFour Software, Gdoor Sistemas e JL Sistemas."
        },
        {
            "titulo": "Desenvolvedor de Software",
            "instituicao": "LIGA Sistemas LTDA",
            "ano": "2019 - até agora",
            "descricao": "Atuo diretamente no desenvolvimento de melhorias e implementações de 5 software voltado para o seguimento de analises clínicas laboratoriais. Cada um dos 5 software realizam uma demanda especifica. O software InfoLAB que é responsável por toda a interação do usuário, como realização de cadastros, atendimento, lançamento de notas fiscais, relatórios e muito mais. O software InterMAX que é responsável por monitorar, interpretar e traduzir para o InfoLAB os resultados dos analisadores. O software VIU que tem por sua finalidade capturar as informações dos analisadores, via porta serial ou rede interna, e enviar para o InterMAX. O software LIGAServ realiza a camada de servidor da aplicação. O software LIGASync que realiza as integrações com sistema terceiro, ele realiza os processos de Web-Service podendo ser trabalhado com requisições REST ou SOAP, trabalhando como cliente ou servidor. Em alguns casos crio ferramentas que ajudam os analistas a realizarem processo do dia a dia. Trabalhando em cima dessas 5 aplicações principais tenho total conhecimento com os processos via web service (REST FULL e SOAP), que permitem a integração com diversos sistemas hospitalares e clinicas parceiras, processo de criação de notas fiscais, relatório, analise de dados, arquitetura MVC, automação com analisadores nos protocolos (HL7, ASTM, ABX e protocolos de comunicação próprio), criação de DLL's quando necessário em outro ambiente, como integração com o sistema de notas fiscais de serviço usando o padrão ABRASF. No processo de desenvolvimento utilizo metodologias ágeis e ferramentas que ajudam e auxiliam na documentações e nos processos de cada tarefa, como a ferramenta Jira, o Tortoise e outros recursos. Recebi a missão de migrar e modernizar a arquitetura dos cinco sistemas citados para o ambiente web, reestruturando o banco de dados, revisando regras de negócio e aplicando boas práticas atuais, a fim de garantir aplicações modernas, rápidas e seguras."
        }
    ]
}